set_property PACKAGE_PIN F15 [get_ports rx_clk]
set_property IOSTANDARD LVCMOS33 [get_ports rx_clk]
set_property IOSTANDARD LVCMOS33 [get_ports rx_dv]
set_property IOSTANDARD LVCMOS33 [get_ports tx_clk]
set_property IOSTANDARD LVCMOS33 [get_ports rstb]
set_property IOSTANDARD LVCMOS33 [get_ports tx_en]
set_property PACKAGE_PIN H16 [get_ports tx_clk]
set_property PACKAGE_PIN D18 [get_ports {rxd[0]}]
set_property PACKAGE_PIN G17 [get_ports {rxd[3]}]
set_property PACKAGE_PIN E18 [get_ports {rxd[2]}]
set_property PACKAGE_PIN E17 [get_ports {rxd[1]}]
set_property PACKAGE_PIN G16 [get_ports rx_dv]
set_property PACKAGE_PIN H14 [get_ports {txd[0]}]
set_property PACKAGE_PIN J14 [get_ports {txd[1]}]
set_property PACKAGE_PIN J13 [get_ports {txd[2]}]
set_property PACKAGE_PIN H17 [get_ports {txd[3]}]
set_property PACKAGE_PIN H15 [get_ports tx_en]
set_property PACKAGE_PIN D9 [get_ports rstb]
set_property IOSTANDARD LVCMOS33 [get_ports {rxd[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {rxd[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {rxd[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {rxd[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {txd[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {txd[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {txd[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {txd[0]}]

create_clock -period 40.000 -name rx_clk [get_ports rx_clk]
create_clock -period 40.000 -name tx_clk [get_ports tx_clk]
set_clock_groups -asynchronous -group [get_clocks rx_clk] -group [get_clocks tx_clk]
set_input_delay  -clock rx_clk -max 10.0 [get_ports {rxd[*] rx_dv}]
set_input_delay  -clock rx_clk -min 0.0  [get_ports {rxd[*] rx_dv}]
set_output_delay -clock tx_clk -max 10.0 [get_ports {txd[*] tx_en}]
set_output_delay -clock tx_clk -min 0.0  [get_ports {txd[*] tx_en}]
set_input_delay  -clock rx_clk -max 10.0 [get_ports rstb]
set_input_delay  -clock rx_clk -min 0.0  [get_ports rstb]
